app/Controllers/ProdutoController.php

    public function index()
    {
        $data['produtos'] = $this->produtoModel->paginate(1); // 10 produtos por página
---
SELECT *
FROM `produtos`
 LIMIT 1, 1
SELECT COUNT(*) AS `numrows`
FROM `produtos`

    public function store()
    {
        $this->produtoModel->save([
            'nome' => $this->request->getPost('nome'),
            'descricao' => $this->request->getPost('descricao'),
            'preco' => $this->request->getPost('preco'),
        ]);
---
INSERT INTO `produtos` (`nome`, `descricao`, `preco`, `created_at`, `updated_at`) VALUES ('Molinete Sienna 500', 'Ótimo molinete para pescas de peixes pequenos, sendo de fácil transporte e de ótimo peso e robustez.', '150', '2024-10-31 17:26:46', '2024-10-31 17:26:46')