app/Controllers/ProfileController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
    public function index()
    {
        $userId = session()->get('userId');
        $user = $this->userModel->find($userId); // Usando o método para ocultar campos sensíveis